In [1]:
import os
os.getcwd()

'C:\\Users\\ramreddymyla\\RRITEC_TRAINING_ASSETS\\Data-Analysis'

In [2]:
import pandas as pd
df=pd.read_csv("data/pandas_sales.csv")
df

  month  eggs  salt  spam
0   Jan    47  12.0    17
1   Feb   110  50.0    31
2   Mar   221  89.0    72
3   Apr    77  87.0    20
4   May   132   NaN    52
5   Jun   205  60.0    55

In [3]:
df=pd.read_csv("data/pandas_sales.csv",index_col="month")
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Jan to Jun
Data columns (total 3 columns):
eggs    6 non-null int64
salt    5 non-null float64
spam    6 non-null int64
dtypes: float64(1), int64(2)
memory usage: 192.0+ bytes

In [5]:
df.head()

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52

In [6]:
df.tail()

       eggs  salt  spam
month
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [7]:
df.head(2)

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31

In [8]:
# method 1: we want to read by index ([columnanem][rowname])

In [9]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [10]:
# print 47

In [12]:
df["eggs"]["Jan"]

47

In [13]:
# print 72

In [15]:
df["spam"]["Mar"]

72

In [16]:
# slice and fancy methods are not supported

# Method 2: Column Attribute[rowindex]

In [17]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [19]:
df.eggs[0]

47

In [21]:
df.eggs[0:3] # slice method

month
Jan     47
Feb    110
Mar    221
Name: eggs, dtype: int64

In [22]:
df.eggs[[0,3]]# fancy method

month
Jan    47
Apr    77
Name: eggs, dtype: int64

# method 3: Loc method

In [24]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [42]:
df.iloc[0,0] # pick one particular value using row label and column labels
# loc == label method

47

In [43]:
# print 89
df.iloc[2,1]

89.0

In [44]:
# print 52
df.iloc[4,2]

52

In [45]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [46]:
df.iloc[0:3,0] #slice

month
Jan     47
Feb    110
Mar    221
Name: eggs, dtype: int64

In [47]:
df.iloc[[0,3],0] #fancy

month
Jan    47
Apr    77
Name: eggs, dtype: int64

In [36]:
#df.loc?

In [38]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [37]:
df.loc[[True,False,False,True,False,True]]

       eggs  salt  spam
month
Jan      47  12.0    17
Apr      77  87.0    20
Jun     205  60.0    55

In [48]:
# Method 4: iloc method

# create df based on another df

In [49]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [50]:
# 
#create table sub_df as select eggs,salt from df

In [52]:
sub_df=df[["eggs","salt"]] # [[]]

In [53]:
type(sub_df)

pandas.core.frame.DataFrame

In [54]:
sub_df

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0

In [55]:
# create a series =column + index

In [56]:
s=df.eggs

In [57]:
s

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [58]:
type(s)

pandas.core.series.Series

In [59]:
df = pd.read_csv("data/iris.csv")

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
sepal_length    150 non-null float64
sepal_width     150 non-null float64
petal_length    150 non-null float64
petal_width     150 non-null float64
species         150 non-null object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [62]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [63]:
df.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [64]:
#0,50,100

In [65]:
df.iloc[[0,50,100]]

     sepal_length  sepal_width  petal_length  petal_width     species
0             5.1          3.5           1.4          0.2      setosa
50            7.0          3.2           4.7          1.4  versicolor
100           6.3          3.3           6.0          2.5   virginica

In [66]:
X=df[["sepal_length","sepal_width","petal_length","petal_width"]]

In [67]:
type(X)

pandas.core.frame.DataFrame

In [68]:
X.head()

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2

In [69]:
y=df.species

In [70]:
type(y)

pandas.core.series.Series

In [71]:
y.head()

0    setosa
1    setosa
2    setosa
3    setosa
4    setosa
Name: species, dtype: object

In [72]:
X_array=X.values

In [74]:
X_array.ndim

2

In [75]:
#df = 2d

In [76]:
y_array=y.values

In [78]:
y_array.ndim

1

In [79]:
#series = 1d array